Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: A computer scientist will correctly explain that all programs are interpreted and that the only question is at what level.
es: Un científico de computación puede explicarle correctamente que, en realidad, todos los programas son interpretados y solo se diferencian en el grado en que lo son.

source: A constant subroutine is one prototyped to take no arguments and to return a constant expression.
es: Una subrutina constante es una subrutina cuyo prototipo no consume argumentos y devuelve una expresión constante.

source: A construct that performs something repeatedly, like a roller coaster.
es: Construcción que realiza algo repetidamente, como una montaña rusa.

source: A construct that sometimes looks like a function but really isn't.
es: Construcción que a veces parece una función, sin serlo realmente.

source: A counting number, like 1, 2, 3, and so on, but including 0 and the negatives.
es: Es un número que sirve para contar, como 1, 2, 3, etc. También se incluyen el 0 y los números negativos correspondientes.

source: A cracker may be a true L</hacker> or only a L</script kiddie>.
es: Un cracker puede ser un auténtico L</hacker> o simplemente un L</script kiddie>.

source: A data structure used internally by Perl for implementing associative arrays (hashes) efficiently.
es: Estructura de datos usada internamente por Perl para implementar arrays asociativos (hashes) de manera eficiente.

source: A declaration is like the part of your recipe that says, "two cups flour, one large egg, four or five tadpoles..." See L</statement> for its opposite.
es: Una declaración es como la parte de una receta que dice "dos tazas de harina, un huevo grande, cuatro o cinco renacuajos...". Para ver una definición de su opuesto, vea L</instrucción>.

source: A description of how C types may be transformed to and from Perl types within an L</extension> module written in L</XS>.
es: Descripción de cómo pueden transformarse los tipos de C en tipos de Perl y viceversa en un módulo de L</extensión> escrito en L</XS>.

source: A device you can put things on the top of, and later take them back off in the opposite order in which you put them on.
es: Dispositivo en el que se pueden colocar cosas para recuperarlas posteriormente en orden inverso al de colocación.

source: A direct L</connection> that carries the output of one L</process> to the input of another without an intermediate temporary file.
es: L<Conexión|/conexión> directa que pasa la salida de un L</proceso> a la entrada de otro sin usar un archivo temporal intermedio.

source: A domain of names.
es: Dominio de nombres.

source: A fancy computer science term meaning "to follow a L</reference> to what it points to".
es: Término informático sofisticado que significa "seguir una L</referencia> hasta aquello a lo que apunta".

source: A fancy kind of interlock that prevents multiple L<threads|/thread> or L<processes|/process> from using up the same resources simultaneously.
es: Tipo de interbloqueo sofisticado que impide que varios L<hilos de ejecución|/hilo de ejecución> o L<procesos|/proceso> usen los mismos recursos simultáneamente.

source: A fancy term for an error.
es: Término pretencioso para designar un error.

source: A feature of L</operator overloading> of L<objects|/object>, whereby the behavior of certain L<operators|/operator> can be reasonably deduced using more fundamental operators.
es: Característica de la L</sobrecarga de operador> de L<objetos|/objeto> que permite deducir de forma razonable mediante operadores básicos el comportamiento de determinados L<operadores|/operador>.

source: A few general-purpose tools are shipped with perl, mostly because they came along modules included in the perl distribution.
es: También se distribuyen con perl algunas herramientas de propósito general, básicamente porque forman parte de módulos incluidos en la distribución de perl.

source: A few of these are good, some are OK, but many aren't worth your money.
es: Algunos son buenos y otros aceptables, pero muchos no merecen la pena.

source: A file containing certain required definitions that you must include "ahead" of the rest of your program to do certain obscure operations.
es: Archivo que contiene algunas definiciones necesarias que hay que incluir antes que el resto del programa para realizar determinadas operaciones "oscuras".

source: A file may also have a L</group> of users who may exercise joint ownership if the real owner permits it.
es: Un archivo también puede tener un L</grupo> de usuarios que pueden ser copropietarios, si el propietario real lo permite.

source: A file that controls the compilation of a program.
es: Archivo que controla la compilación de un programa.

source: A flow of data into or out of a process as a steady sequence of bytes or characters, without the appearance of being broken up into packets.
es: Flujo de datos que entra o sale en un proceso como una serie continua de bytes o caracteres sin la apariencia de estar dividido en paquetes.

source: A form of L</scalar context> in which an L</expression> is not expected to return any L</value> at all and is evaluated for its L</side effects> alone.
es: Forma de L</contexto escalar> en el que no se espera que una L</expresión> devuelva ningún L</valor> y solo se evalúa por sus L</efectos secundarios>.

source: A fully qualified filename is specified from the top-level directory.
es: Un nombre completo de archivo se especifica con respecto al directorio de nivel superior.

source: A fully qualified filename such as I</usr/bin/perl>.
es: Nombre completo de archivo, como I</usr/bin/perl>.

source: A fundamental feature of regular expression matching involves the notion called I<backtracking>, which is currently used (when needed) by all regular non-possessive expression quantifiers, namely C<*>, C<*?>, C<+>, C<+?>, C<{n,m}>, and C<{n,m}?>.
es: Una característica fundamental de las expresiones regulares es la noción de la vuelta atrás (I<backtracking>), que actualmente usan (cuando es necesario) todos los cuantificadores de expresiones regulares no posesivos: C<*>, C<*?>, C<+>, C<+?>, C<{n,m}> y C<{n,m}?>.

source: A generic L</object> type; that is, a L</class> from which other, more specific classes are derived genetically by L</inheritance>.
es: Tipo de L</objeto> genérico; es decir, una L</clase> de la que se derivan genéticamente otras clases más específicas mediante L</herencia>.

source: A getter gets the attribute's value, while a setter sets it.
es: Un método I<getter> obtiene el valor del atributo, mientras que un método I<setter> lo establece.

source: A given operator may have specific expectations about what L<types|/type> of data you give as its arguments (L<operands|/operand>) and what type of data you want back from it.
es: Un operador determinado pueden tener expectativas específicas sobre los L<tipos|/tipo> de datos que se le deben pasar como argumentos (L<operandos|/operando>) y el tipo de datos que debe devolver.

source: A gizmo that transforms some number of input values to some number of output values, often built into a language with a special syntax or symbol.
es: Artilugio que transforma un número determinado de valores de entrada en un número determinado de valores de salida, y que suele estar predefinido en un lenguaje con una sintaxis o un símbolo especiales.

source: A global variable in Perl can be localized inside a L<dynamic scope|/dynamic scoping> via the L<local|perlfunc/local> operator.
es: Una variable global en Perl se puede hacer local dentro de un L<ámbito dinámico|/control de ámbito dinámico> a través del operador L<local|perlfunc/local>.

source: A glossary of terms (technical and otherwise) used in the Perl documentation.
es: Un glosario de términos (técnicos y de otro tipo) que se usan en la documentación de Perl.

source: A group of related modules on L</CPAN>.
es: Conjunto de módulos de L</CPAN> relacionados.

source: A hard reference is different from a L</symbolic reference>.
es: Una referencia estricta no es lo mismo que una L</referencia simbólica>.

source: A hash can be initialized using a literal list holding pairs of items to be interpreted as a key and a value:
es: Un hash se puede inicializar con una lista literal que contenga pares de elementos que deben interpretarse como pares clave/valor:

source: A hash can optionally be L<restricted|/restricted hash> to a fixed set of keys.
es: Opcionalmente, un hash se puede L<restringir|/hash restringido> a un conjunto fijo de claves.

source: A hash is also sometimes septisyllabically called an "associative array", which is a pretty good reason for simply calling it a "hash" instead.
es: A veces se usa el septisílabo "array asociativo" para designar un hash. Esto es en sí una buena razón para preferir el nombre "hash".

source: A hash represents a set of key/value pairs:
es: Un hash representa un conjunto de pares clave-valor:

source: A kind of L</overloading> that you can do on built-in L<operators|/operator> to make them work on L<objects|/object> as if the objects were ordinary scalar values, but with the actual semantics supplied by the object class.
es: Tipo de L</sobrecarga> que se puede realizar en L<operadores|/operador> predefinidos para que se apliquen a L<objetos|/objeto> como si estos fueran valores escalares normales, pero con la semántica suministrada por la clase del objeto.

source: A kind of action that an L</object> can take if you tell it to.
es: Tipo de acción que un L</objeto> puede realizar si se le ordena.

source: A kind of key or name attached to a loop (or roller coaster) so that loop control statements can talk about which loop they want to control.
es: Tipo de clave o nombre asociado a un bucle (o una montaña rusa) que permite especificar en instrucciones de control de bucle el bucle que se desea controlar.

source: A kinder, gentler tutorial on object-oriented programming in Perl can be found in L<perlootut>.
es: Si desea leer una introducción más accesible y sencilla a la programación orientada a objetos en Perl, vea el documento L<perlootut>.

source: A language beloved by many for its inside-out L</type> definitions, inscrutable L</precedence> rules, and heavy L</overloading> of the function-call mechanism.
es: Lenguaje muy querido por muchos programadores por su definiciones de L<tipos|/tipo> I<inside-out>, sus reglas de L</precedencia> inescrutables y la intensa L<sobrecarga|/sobrecargar> del mecanismo de llamada de funciones.

source: A language such as Perl that is good at hooking things together that weren't intended to be hooked together.
es: Lenguaje como Perl, que es muy útil para conectar cosas que en principio no se usan juntas.

source: A language to extend Perl with L<C> and C++.
es: Lenguaje que permite extender Perl con código L<C> y C++.

source: A later C<(*SKIP)> pattern will then skip forward to that point if backtracked into on failure.
es: Un patrón C<(*SKIP)> posterior saltará a ese punto si hace una vuelta atrás a causa de un error de coincidencia.

source: A legally formed name for most anything in which a computer program might be interested.
es: Nombre válido para prácticamente cualquier cosa que pueda interesar a un programa.

source: A list of them is given at the start of L<perlfunc> and you can easily read about any given function by using C<perldoc -f I<functionname>>.
es: Al principio de L<perlfunc> se incluye una lista completa de funciones. También puede obtener fácilmente información sobre cualquier función mediante el comando C<perldoc -f I<nombre_función>>.

source: A list of possible choices from which you may select only one, as in "Would you like door A, B, or C?" Alternatives in regular expressions are separated with a single vertical bar: C<|>.
es: Lista de elecciones posibles de las que solo se puede seleccionar una, como en "¿Qué sobre elige, A, B o C?". En las expresiones regulares dos alternativas se separan mediante una sola barra vertical: C<|>.

source: A list value may also be subscripted like a normal array.
es: Una lista de valores también se puede indexar como un array normal.

source: A literal of the form C<v1.20.300.4000> is parsed as a string composed of characters with the specified ordinals.
es: Un literal de la forma C<v1.20.300.4000> se analiza como una cadena compuesta de caracteres con los valores ordinales especificados.

source: A little interface to ExtUtils::Installed to examine installed modules, validate your packlists and even create a tarball from an installed module.
es: Esta utilidad ofrece una interfaz sencilla de ExtUtils::Installed, que permite examinar módulos instalados, validar las listas de paquetes e incluso crear un archivo de almacenamiento tar a partir de un módulo instalado.

source: A location in a L</hash table> containing (potentially) multiple entries whose keys "hash" to the same hash value according to its hash function.
es: Ubicación de una L</tabla hash> que puede contener varias entradas cuyas claves corresponde al mismo valor de hash según su función de hash.

source: A manpage contains a SYNOPSIS, a DESCRIPTION, a list of BUGS, and so on, and is typically longer than a page.
es: Una página de manual contiene una SINOPSIS, una DESCRIPCIÓN, una lista de ERRORES, etc., y generalmente no cabe en una sola página.

source: A mask of those L</permission bits> that should be forced off when creating files or directories, in order to establish a policy of whom you'll ordinarily deny access to.
es: Máscara de los L</bits de permiso> que deben desactivarse al crear archivos o directorios, a fin de establecer una política de usuarios a los que normalmente se les denegaría el acceso.

source: A mechanism by which some high-level agent such as a user can pass its preferences down to its future offspring (child L<processes|/process>, grandchild processes, great-grandchild processes, and so on).
es: Mecanismo mediante el cual un agente de alto nivel, como un usuario, puede pasar sus preferencias a sus futuros descendientes (L<procesos|/proceso> derivados de primer nivel, de segundo nivel, etc.).

source: A mechanism in Perl that lets you store up the output of each Perl L</command> and then flush it out as a single request to the L</operating system>.
es: Mecanismo de Perl que permite almacenar la salida de cada L</comando> de Perl y después volcarlo como una sola solicitud al L</sistema operativo>.

source: A message printed to the L</STDERR> stream to the effect that something might be wrong but isn't worth blowing up over.
es: Mensaje que se imprime en la secuencia L</STDERR> para indicar que puede haber un problema, pero que no es necesario detener la ejecución.

source: A method associated with the class as a whole.
es: Un método asociado a la clase como un todo.

source: A method is simply a subroutine that expects a reference to an object (or a package name, for class methods) as the first argument.
es: Un método es simplemente una subrutina que espera recibir una referencia a un objeto (o un nombre de paquete, en el caso de los métodos de la clase) como primer argumento.

source: A method of making input and output efficient by passing one L</block> at a time.
es: Método para lograr una entrada y salida eficiente pasando un L<bloque|/bloqueo-bloque> cada vez.

source: A method of storing numbers in "scientific notation", such that the precision of the number is independent of its magnitude (the decimal point "floats").
es: Método para almacenar números con "notación científica" en el que la precisión del número es independiente de su magnitud (el punto decimal "flota").

source: A misnamed feature--it should be called, "expecting your mother to pick up after you".
es: Característica con un nombre desafortunado; debería llamarse "esperar que tu madre limpie tu desorden".

source: A missing pattern always matches.
es: Un patrón no presente siempre coincide.

source: A module is just a set of related functions in a library file, i.e., a Perl package with the same name as the file.
es: Un módulo no es más que un conjunto de funciones relacionadas y ubicadas en un archivo de biblioteca, es decir, un paquete Perl con el mismo nombre que el archivo.

source: A module that breaks a program text into a sequence of L<tokens|/token> for later analysis by a parser.
es: Módulo que divide el texto de un programa en una secuencia de L<tokens|/token> para que el analizador los analice posteriormente.

source: A module's code has to be warning and strict-clean, since you can't guarantee the conditions that it'll be used under.
es: Debe usar los pragmas warnings y strict en el código de su módulo, ya que no sabe en qué condiciones se va a usar.

source: A morpheme in a programming language, the smallest unit of text with semantic significance.
es: Morfema en un lenguaje de programación. Es la unidad de texto con significado semántico más pequeña.

source: A name that represents a particular instance of opening a directory to read it, until you close it.
es: Nombre que representa una instancia concreta de un directorio abierto para lectura, hasta que se cierra dicho directorio.

source: A name you give to a L</statement> so that you can talk about that statement elsewhere in the program.
es: Nombre que se asigna a una L</instrucción> para poder hacer referencia a la misma en otro punto del programa.

source: A named capture group.
es: Un grupo de captura con nombre.

source: A named collection of data, usually stored on disk in a L</directory> in a L</filesystem>.
es: Conjunto de datos con nombre que suele estar almacenado en disco, dentro de un L</directorio> de un L</sistema de archivos>.

source: A named or otherwise accessible piece of program that can be invoked from elsewhere in the program in order to accomplish some sub-goal of the program.
es: Parte de un programa que tiene un nombre o es accesible de otra manera, de forma que se pueda invocar desde otro punto del programa para realizar alguna tarea secundaria.

source: A named storage location that can hold any of various kinds of L</value>, as your program sees fit.
es: Ubicación de almacenamiento con nombre que puede contener cualquiera de los distintos tipos de L<valores|/valor> que necesite el programa.

source: A negative subscript retrieves its value from the end.
es: Un subíndice negativo devuelve un valor contando desde el final.

source: A new feature that allows the declaration of L<variables|/variable> and L<subroutines|/subroutine> with modifiers as in C<sub foo : locked method>.
es: Nueva característica que permite declarar L<variables|/variable> y L<subrutinas|/subrutina> como modificadores, como en C<sub foo : metodo bloqueado>.

source: A nickname for something, which behaves in all ways as though you'd used the original name instead of the nickname.
es: Apodo de algo, que se comporta en todos los sentidos como si se usara el nombre original.

source: A notional "baton" handed around the Perl community indicating who is the lead integrator in some arena of development.
es: "Testigo" teórico que se transmite en la comunidad Perl para indicar quién es el integrador jefe en algún campo de desarrollo.

source: A number in base 16, "hex" for short.
es: Número en base 16 (se suele abreviar como "hex").

source: A number in base 8.
es: Número en base 8.

source: A number or quoted L</string>--an actual L</value> in the text of your program, as opposed to a L</variable>.
es: Número o L</cadena> entre comillas; un L</valor> real en el texto del programa, en contraste con una L</variable>.

source: A number with no fractional (decimal) part.
es: Número sin parte fraccionaria (decimal).

source: A package statement affects only dynamic variables--including those you've used local() on--but I<not> lexical variables created with my().
es: Una instrucción C<package> solo afecta a las variables dinámicas, incluidas aquellas en las que se usa local(); I<no> afecta a las variables léxicas creadas con my().

source: A packet of data, such as a L</UDP> message, that (from the viewpoint of the programs involved) can be sent independently over the network.
es: Paquete de datos, como un mensaje L</UDP>, que (desde el punto de vista de los programas implicados) se puede enviar de forma independiente a través de la red.

source: A parenthesized L</subpattern> used to group parts of a L</regular expression> into a single L</atom>.
es: L<Subpatrón|/subpatrón> escrito entre paréntesis que se usa para agrupar partes de una L</expresión regular> en un solo L</átomo>.

source: A parser generator without which Perl probably would not have existed.
es: Un generador de analizadores sin el cual Perl probablemente no habría existido.

source: A patch for FreeBSD libc is available (see http://www.freebsd.org/cgi/query-pr.cgi?pr=misc/30631 ) which has been integrated into FreeBSD 4.6.
es: Está disponible un parche de FreeBSD libc (vea http://www.freebsd.org/cgi/query-pr.cgi?pr=misc/30631) que se ha integrado en FreeBSD 4.6.

source: A patch was submitted that added a couple of tests to an existing .t.
es: Se envió un parche para agregar un par de pruebas a un archivo .t existente.

source: A pattern that contains one or more variables to be interpolated before parsing the pattern as a L</regular expression>, and that therefore cannot be analyzed at compile time, but must be re-analyzed each time the pattern match operator is evaluated.
es: Patrón que contiene una o más variables que deben interpolarse antes de que se analice el patrón como una L</expresión regular> y que, por tanto, no se puede analizar en tiempo de compilación, sino que se debe volver a analizar cada vez que se evalúa el operador de detección de patrón.

source: A pidgin-like language spoken among 'droids when they don't wish to reveal their orientation (see L</endian>).
es: Lenguaje tipo pidgin que hablan los androides cuando no desean revelar su orientación (vea L</endian>).

source: A piece of L</memory> accessible by two different L<processes|/process> who otherwise would not see each other's memory.
es: Parte de la L</memoria> accesible para dos L<procesos|/proceso> distintos que, de otro modo, no podrían ver la memoria del otro.

source: A piece of data supplied to a L<program|/executable file>, L</subroutine>, L</function>, or L</method> to tell it what it's supposed to do.
es: Elementos de datos que se suministra a un L<programa|/archivo ejecutable>, una L</subrutina>, una L</función> o un L</método> para indicarle qué debe hacer.

source: A piece of data worth eight L<bits|/bit> in most places.
es: En la mayoría de los contextos es un elemento de datos formado por ocho L<bits|/bit>.

source: A portion of a L</string>, starting at a certain L</character> position (L</offset>) and proceeding for a certain number of characters.
es: Parte de una L</cadena>, que empieza en una posición de L</carácter> (L</desplazamiento>) determinada y mide un número determinado de caracteres.

source: A powerful tool for optimizing such beasts is what is known as an "independent group", which does not backtrack (see L</C<< (?>pattern) >>>).
es: Una herramienta eficaz para optimizar estos engendros es lo que se conoce como un "grupo independiente", que no vuelve atrás (vea L</C<< (?>patrón) >>>).

source: A pragma is a module which influences some aspect of the compile time or run time behaviour of Perl, such as C<strict> or C<warnings>.
es: Un pragma (como C<strict> o C<warnings>) es un módulo que influye en algún aspecto del tiempo de compilación o de ejecución en Perl.

source: A precomputed hash value for the MRO's name, or 0.
es: Un valor de hash calculado previamente para el nombre del orden de resolución de métodos, o bien 0.
